xtra72/CC1310/rfWsnConcentrator_CC1310_LAUNCHXL_tirtos_ccs/ConcentratorTask.c
    DataQ_init(&dataQ_, 4);

    /* Register a packet received callback with the radio task */
    ConcentratorRadioTask_registerPacketReceivedCallback(ConcentratorTask_packetReceivedCallback);

    /* Enter main task loop */
    while(1)
    {
        uint32_t    currentReceivedTime;

        /* Wait for event */
        uint32_t events = Event_pend(concentratorEventHandle, 0, CONCENTRATOR_EVENT_ALL, BIOS_WAIT_FOREVER);

        /* If we got a new ADC sensor value */
        if(events & CONCENTRATOR_EVENT_NEW_RAW_DATA)
        {
            uint32_t    i;

            /* If we knew this node from before, update the value */
            if(ConcentratorTask_isKnownNodeAddress(latestActiveAdcSensorNode.address))
            {
                ConcentratorTask_updateNode(&latestActiveAdcSensorNode);
            }
            else
            {
                /* Else add it */
                ConcentratorTask_addNewNode(&latestActiveAdcSensorNode);
            }

            receivedPacket++;
            receivedDataSize += latestRawDataNode.length;
            successfullyReceivedPacket++;
            totalReceivedPacket++;
            totalReceivedDataSize += latestRawDataNode.length;
            totalSuccessfullyReceivedPacket++;

            for(i = 0 ; i < latestRawDataNode.length ; i++)
            {
                uint8_t hi = (latestRawDataNode.data[i] >> 4) & 0x0F;
                uint8_t lo = (latestRawDataNode.data[i]     ) & 0x0F;
                if (hi < 10)
                {
                    buffer[i*2] ='0' + hi;
                }
                else
                {
                    buffer[i*2] ='A' + hi - 10;
                }

                if (lo < 10)
                {
                    buffer[i*2 + 1] ='0' + lo;
                }
                else
                {
                    buffer[i*2 + 1] ='A' + lo - 10;
                }
            }

            buffer[i*2]= 0;

            ShellTask_output("+DATA: %4d.%03d, %d, %s\n", latestRawDataNode.time / 1000, latestRawDataNode.time % 1000, latestRawDataNode.length, buffer);

        }
        else if(events & CONCENTRATOR_EVENT_TEST_RESET)
        {
            /* If we knew this node from before, update the value */
            if(ConcentratorTask_isKnownNodeAddress(latestActiveAdcSensorNode.address))
            {
                ConcentratorTask_updateNode(&latestActiveAdcSensorNode);
            }
            else
            {
                /* Else add it */
                ConcentratorTask_addNewNode(&latestActiveAdcSensorNode);
            }

            receivedPacket = 0;
            receivedDataSize = 0;
            successfullyReceivedPacket = 0;
            totalReceivedPacket = 0;
            totalReceivedDataSize = 0;
            totalSuccessfullyReceivedPacket = 0;
        }
        else if(events & CONCENTRATOR_EVENT_ERROR)
        {
            receivedPacket++;
            totalReceivedPacket++;
        }

        currentReceivedTime = (Clock_getTicks() * Clock_tickPeriod) / 1000000;

        if (currentReceivedTime != previousReceivedTime)
        {
            //clear screen, put cuser to beggining of terminal and print the header
            Trace_printf("%8d %8d %8d %3d %8d %8d %8d %3d\n",
                           receivedDataSize, successfullyReceivedPacket, receivedPacket, successfullyReceivedPacket * 100 / receivedPacket,
                           totalReceivedDataSize, totalSuccessfullyReceivedPacket, totalReceivedPacket, totalSuccessfullyReceivedPacket * 100 / totalReceivedPacket);
            receivedPacket =  0;
            receivedDataSize = 0;
            successfullyReceivedPacket = 0;

            previousReceivedTime = currentReceivedTime;
        }
    }
}

static void ConcentratorTask_packetReceivedCallback(union ConcentratorPacket* packet, int8_t rssi)
{
    /* If we recived an ADC sensor packet, for backward compatibility */
    if(packet->header.packetType == RADIO_PACKET_TYPE_RAW_DATA_PACKET)
    {
        /* Save the values */
        latestRawDataNode.time = (Clock_getTicks() * Clock_tickPeriod) / 1000;
        latestRawDataNode.address = packet->header.sourceAddress;
        latestRawDataNode.length = packet->header.length;
        memcpy(latestRawDataNode.data, packet->rawDataPacket.data, latestRawDataNode.length);
        latestRawDataNode.latestRssi = rssi;

        DataQ_push(&dataQ_, packet->rawDataPacket.data, packet->header.length);

        Event_post(concentratorEventHandle, CONCENTRATOR_EVENT_NEW_RAW_DATA);
    }
    else if(packet->header.packetType == RADIO_PACKET_TYPE_TEST_RESET)
    {
        /* Save the values */
        Event_post(concentratorEventHandle, CONCENTRATOR_EVENT_TEST_RESET);
    }
    else
    {
        Event_post(concentratorEventHandle, CONCENTRATOR_EVENT_ERROR);
    }
}

static uint8_t ConcentratorTask_isKnownNodeAddress(uint8_t address)
{
    uint8_t found = 0;
    uint8_t i;
    for (i = 0; i < CONCENTRATOR_MAX_NODES; i++)
    {
        if (knownSensorNodes[i].address == address)
        {
            found = 1;
            break;
        }
    }
    return found;
}

static void ConcentratorTask_updateNode(struct AdcSensorNode* node)
{
    uint8_t i;
    for (i = 0; i < CONCENTRATOR_MAX_NODES; i++) {
        if (knownSensorNodes[i].address == node->address)
        {
            knownSensorNodes[i].latestAdcValue = node->latestAdcValue;
            knownSensorNodes[i].latestRssi = node->latestRssi;
            knownSensorNodes[i].button = node->button;
            break;
        }
    }
}

static void ConcentratorTask_addNewNode(struct AdcSensorNode* node)
{
    *lastAddedSensorNode = *node;

    /* Increment and wrap */
    lastAddedSensorNode++;
    if (lastAddedSensorNode > &knownSensorNodes[CONCENTRATOR_MAX_NODES-1])
    {
        lastAddedSensorNode = knownSensorNodes;
    }
}

bool ConcentratorTask_sendCommand(uint8_t _device_id, uint8_t cmd, uint8_t* _params, uint32_t _length)
{
    return  ConcentratorRadioTask_postCommand(_device_id, cmd, _params, _length);
}


bool    ConcentratorTask_commandConfig(int argc, char *argv[])
{
    if (argc == 1)
    {
        int8_t  power;

        EasyLink_getRfPower(&power);
        ShellTask_output("+%s:OK,FREQ=%d,POW=%d,LOG=%s\n", argv[0],  EasyLink_getFrequency(), power, (Trace_isEnable()?"ON":"OFF"));
    }
    else
    {
        int i;
        for(i = 1 ; i < argc ; i++)
        {
            char* name = strtok(argv[i], "=");
            if (strcasecmp(name, "ADDR") == 0)
            {
                char* value = strtok(NULL, " ");
                if (value != 0)
                {
                    uint32_t    addr = strtoul(value, NULL, 10);
                    if (addr <= 254)
                    {
                        radioConfig_.address = addr;
                    }
                    else
                    {
                        ShellTask_output("+%s:ERR, Invalid address[%s]\n", argv[0], value);
                        return  false;
                    }
                }
            }
            else if (strcasecmp(name, "FREQ") == 0)
            {
                char* value = strtok(NULL, " ");
                if (value != 0)
                {
                    uint32_t    frequency = strtoul(value, NULL, 10);
                    if ((RADIO_FREQUENCY_MIN <= frequency) && (frequency <= RADIO_FREQUENCY_MAX))
                    {
                        radioConfig_.frequency = frequency;
                    }
                    else
                    {
                        ShellTask_output("+%s:ERR,Invalid Frequency[%s]\n", argv[0], value);
                        return  false;
                    }
                }
            }
            else if (strcasecmp(name, "POW") == 0)
            {
                char* value = strtok(NULL, " ");
                if (value != 0)
                {
                    int32_t    power = strtol(value, NULL, 10);
                    if ((RADIO_POWER_MIN <= power) && (power <= RADIO_POWER_MAX))
                    {
                        radioConfig_.power = power;
                    }
                    else
                    {
                        ShellTask_output("+%s:ERR,Invalid Power[%s]\n", argv[0], value);
                        return  false;
                    }
                }
            }
            else if (strcasecmp(name, "LOG") == 0)
            {
                char* value = strtok(NULL, " ");
                if (value != 0)
                {
                    if (strcasecmp(value, "ON") == 0)
                    {
                        Trace_enable();
                    }
                    else if (strcasecmp(value, "OFF") == 0)
                    {
                        Trace_disable();
                    }
                    else
                    {
                        ShellTask_output("+%s:ERR,Invalid Parameter[%s]\n", argv[0], value);
                        return  false;
                    }
                }
            }
            else
            {
                ShellTask_output("+%s:ERR,Invalid Parameter[%s]", argv[0], name);
                return  false;
            }
        }
        ConcentratorRadioTask_setConfig(&radioConfig_);
    }


