xtra72/CC1310/rfWsnConcentrator_CC1310_LAUNCHXL_tirtos_ccs/ConcentratorTask.c
    ShellTask_output("+%s:OK\n", argv[0]);

    return true;
}


/*
 *  ======== watchdogCallback ========
 */
void watchdogCallback(uintptr_t watchdogHandle)
{
    /*
     * If the Watchdog Non-Maskable Interrupt (NMI) is called,
     * loop until the device resets. Some devices will invoke
     * this callback upon watchdog expiration while others will
     * reset. See the device specific watchdog driver documentation
     * for your device.
     */
    while (1) {}
}
bool    ConcentratorTask_commandReset(int argc, char *argv[])
{
    Watchdog_init();
    Watchdog_Params params;
    Watchdog_Params_init(&params);
    params.callbackFxn = watchdogCallback;
    params.debugStallMode = Watchdog_DEBUG_STALL_ON;
    params.resetMode = Watchdog_RESET_ON;

    Watchdog_Handle handle = Watchdog_open(Board_WATCHDOG0, &params);
    Watchdog_setReload(handle, 100);


    while ( 1 ) {
       // Do nothing, just wait for the reset (and never return from here)
    }

#if 0
    // Disable CPU interrupts
    CPUcpsid();
    // Write reset register
    HWREGBITW( AON_SYSCTL_BASE + AON_SYSCTL_O_RESETCTL, AON_SYSCTL_RESETCTL_SYSRESET_BITN ) = 1;
    // Finally, wait until the above write propagates
    while ( 1 ) {
       // Do nothing, just wait for the reset (and never return from here)
    }
#endif
    return true;
}

bool    ConcentratorTask_commandStatus(int argc, char *argv[])
{
    if (argc == 1)
    {
        ShellTask_output("+%s:OK\n", argv[0]);
    }
    else
    {
        ShellTask_output("+%s:RSSI=%d\n", argv[0], ConcentratorRadioTask_getRssi());
    }

    return true;
}


bool    ConcentratorTask_commandStart(int argc, char *argv[])
{
    ConcentratorRadioConfig config;

    memcpy(&config, &radioConfig_, sizeof(ConcentratorRadioConfig));

    if (argc > 1)
    {
        int i;

        for(i = 1 ; i < argc ; i++)
        {
            char* name = strtok(argv[i], "=");
            if (name != NULL)
            {
                if (strcasecmp(name, "ADDR") == 0)
                {
                    char* value = strtok(NULL, " ");
                    if (value != 0)
                    {
                        uint32_t    addr = strtoul(value, NULL, 10);
                        if (addr <= 254)
                        {
                            config.address = addr;
                        }
                        else
                        {
                            ShellTask_output("+%s:ERR,Invalid Address[%s]\n", argv[0], value);
                            return  false;
                        }
                    }
                }
                else if (strcasecmp(name, "FREQ") == 0)
                {
                    char* value = strtok(NULL, " ");
                    if (value != 0)
                    {
                        uint32_t    frequency = strtoul(value, NULL, 10);
                        if ((RADIO_FREQUENCY_MIN <= frequency) && (frequency <= RADIO_FREQUENCY_MAX))
                        {
                            config.frequency = frequency;
                        }
                        else
                        {
                            ShellTask_output("+%s:ERR,Invalid Frequency[%s]\n", argv[0],value);
                            return  false;
                        }
                    }
                }
                else if (strcasecmp(name, "POW") == 0)
                {
                    char* value = strtok(NULL, " ");
                    if (value != 0)
                    {
                        int32_t    power = strtol(value, NULL, 10);
                        if ((RADIO_POWER_MIN <= power) && (power <= RADIO_POWER_MAX))
                        {
                            config.power = power;
                        }
                        else
                        {
                            ShellTask_output("+%s:ERR,Invalid Power[%s]\n", argv[0], value);
                            return  false;
                        }
                    }
                }
                else
                {
                    ShellTask_output("+%s:ERR,Invalid Param[%s]\n", argv[0], name);
                    return  false;
                }
            }
        }

    }

    if (!ConcentratorRadioTask_isRunning())
    {
        if (ConcentratorRadioTask_init(&config))
        {
            memcpy(&radioConfig_, &config, sizeof(ConcentratorRadioConfig));
            ShellTask_output("+%s:OK\n", argv[0]);
        }
        else
        {
            ShellTask_output("+%s:ERR\n", argv[0]);
        }
    }
    else
    {
        if ((memcmp(&radioConfig_, &config, sizeof(ConcentratorRadioConfig)) == 0) || (ConcentratorRadioTask_setConfig(&config)))
        {
            memcpy(&radioConfig_, &config, sizeof(ConcentratorRadioConfig));
            ShellTask_output("+%s:OK\n", argv[0]);
        }
        else
        {
            ShellTask_output("+%s:ERR\n", argv[0]);
        }
    }


    return  true;
}


bool    ConcentratorTask_commandDownlink(int argc, char *argv[])
{
    if (argc != 3)
    {
        ShellTask_output("+%s:ERR\n", argv[0]);
        return  false;
    }

    uint8_t device_id = (uint8_t)strtoul(argv[1], NULL, 10);
    if (device_id == 0)
    {
        device_id = 2;
    }

    uint8_t length = 0;
    uint8_t i;
    for(i = 0 ; i < strlen(argv[2]) / 2 ; i++)
    {
        uint8_t value = 0;

        if ('0' <= argv[2][i*2] && argv[2][i*2] <= '9')
        {
            value = (argv[2][i*2] - '0');
        }
        else if ('a' <= argv[2][i*2] && argv[2][i*2] <= 'f')
        {
            value = (argv[2][i*2] - 'a' + 10);
        }
        else if ('A' <= argv[2][i*2] && argv[2][i*2] <= 'F')
        {
            value = (argv[2][i*2] - 'A' + 10);
        }

        if ('0' <= argv[2][i*2 + 1] && argv[2][i*2 + 1] <= '9')
        {
            value = (value << 4) + (argv[2][i*2 + 1] - '0');
        }
        else if ('a' <= argv[2][i*2] && argv[2][i*2 + 1] <= 'f')
        {
            value = (value << 4) + (argv[2][i*2 + 1] - 'a' + 10);
        }
        else if ('A' <= argv[2][i*2 + 1] && argv[2][i*2 + 1] <= 'F')
        {
            value = (value << 4) + (argv[2][i*2 + 1] - 'A' + 10);
        }

