xtra72/CC1310/rfWsnConcentrator_CC1310_LAUNCHXL_tirtos_ccs/ConcentratorTask.c
        buffer[length++] = value;
    }

   if (!ConcentratorTask_sendCommand(device_id, RF_DOWNLINK, (uint8_t *)buffer, length))
    {
        ShellTask_output("+%s:ERR\n", argv[0]);
        return  false;
    }

    return true;
}

bool    ConcentratorTask_commandContract(int argc, char *argv[])
{
    if (argc != 3)
    {
        ShellTask_output("+%s:ERR\n", argv[0]);
        return  false;
    }

    uint8_t device_id = (uint8_t)strtoul(argv[1], NULL, 10);
    if (device_id == 0)
    {
        device_id = 2;
    }

    uint32_t ts = (uint32_t)strtoul(argv[2], NULL, 10);
    uint8_t params[4];
    params[0] = (ts >> 24) & 0xFF;
    params[1] = (ts >> 16) & 0xFF;
    params[2] = (ts >>  8) & 0xFF;
    params[3] = (ts      ) & 0xFF;
   if (!ConcentratorTask_sendCommand(device_id, RF_REP_CONTRACT, params, sizeof(params)))
    {
        ShellTask_output("+%s:ERR\n", argv[0]);
        return  false;
    }

    return true;
}

bool    ConcentratorTask_commandScan(int argc, char *argv[])
{
    if (argc != 3)
    {
        ShellTask_output("+%s:ERR\n", argv[0]);
        return  false;
    }

    uint8_t device_id = (uint8_t)strtoul(argv[1], NULL, 10);
    if (device_id == 0)
    {
        device_id = 2;
    }

    if (strcasecmp(argv[2], "ON") == 0)
    {
        if (!ConcentratorTask_sendCommand(device_id, RF_REQ_SRV_SCAN_START, NULL, 0))
        {
            ShellTask_output("+%s:ERR\n", argv[0]);
            return  false;
        }
    }
    else
    {
        if (!ConcentratorTask_sendCommand(device_id, RF_REQ_SRV_SCAN_STOP, NULL, 0))
        {
            ShellTask_output("+%s:ERR\n", argv[0]);
            return  false;
        }
    }

    ShellTask_output("+%s:OK", argv[0]);
    return  true;
}

bool    ConcentratorTask_commandSleep(int argc, char *argv[])
{
    if (argc != 3)
    {
        ShellTask_output("+%s:ERR\n", argv[0]);
        return  false;
    }

    uint16_t device_id = (uint16_t)strtoul(argv[1], NULL, 10);
    uint32_t sleep_time = (uint32_t)strtoul(argv[2], NULL, 10);
    uint8_t params[4];
    if (device_id == 0)
    {
        device_id = 2;
    }

    params[0] = (sleep_time >> 24) & 0xFF;
    params[1] = (sleep_time >> 16) & 0xFF;
    params[2] = (sleep_time >>  8) & 0xFF;
    params[3] = (sleep_time      ) & 0xFF;

    if (!ConcentratorTask_sendCommand(device_id, RF_REQ_SRV_SLEEP, params, 4))
    {
        ShellTask_output("+%s:ERR\n", argv[0]);
        return  false;
    }

    ShellTask_output("+%s:OK\n", argv[0]);
    return  true;
}


bool    ConcentratorTask_commandDetect(int argc, char *argv[])
{
    if (argc != 3)
    {
        ShellTask_output("+%s:ERR\n", argv[0]);
        return  false;
    }

    uint8_t device_id = (uint8_t)strtoul(argv[1], NULL, 10);
    if (device_id == 0)
    {
        device_id = 2;
    }

    if (strcasecmp(argv[2], "ON") == 0)
    {
        if (!ConcentratorTask_sendCommand(device_id, RF_REQ_SRV_MOTION_DETECTION_START, NULL, 0))
        {
            ShellTask_output("+%s:ERR\n", argv[0]);
            return  false;
        }
    }
    else
    {
        if (!ConcentratorTask_sendCommand(device_id, RF_REQ_SRV_MOTION_DETECTION_STOP, NULL, 0))
        {
            ShellTask_output("+%s:ERR\n", argv[0]);
            return  false;
        }
    }

    ShellTask_output("+%s:OK\n", argv[0]);
    return  true;
}

